experiment-finetuned/all_finetuned/runs/pitzDaily/3/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.001;

vertices
(
    // Channel cross-section (mm scale)
    (  0   0   -0.5)   // vertex 0
    ( 50   0   -0.5)   // vertex 1
    ( 50  50   -0.5)   // vertex 2
    (  0  50   -0.5)   // vertex 3
    (  0   0    0.5)   // vertex 4
    ( 50   0    0.5)   // vertex 5
    ( 50  50    0.5)   // vertex 6
    (  0  50    0.5)   // vertex 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 1) simpleGrading (1 1 1)
);

boundary
{
    inlet
    {
        type patch;
        faces ((3 0 4 7));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    upperWall
    {
        type patch;
        faces ((2 3 7 6));
    }
    lowerWall
    {
        type patch;
        faces ((0 1 5 4));
    }
    frontAndBack
    {
        type patch;
        faces ((0 3 2 1) (4 5 6 7));
    }
}

mergePatchNames ();